# Задания с использованием вложенных циклов.
## Тип 2 №15618
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w. На рисунке приведён фрагмент таблицы истинности функции F, 
содержащий все наборы аргументов, при которых функция F ложна. Определите, какому столбцу таблицы 
истинности функции F соответствует каждая из переменных w, x, y, z. Все строки в представленном фрагменте разные.

```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((x and (not y) or (y == z) or (not w))) == False:
                    print(x, y, z, w)
```

Ответ: wzyx

## Тип 2 №35460
Логическая функция F задаётся выражением ¬((x ∨ y) → (z ∧ w)) ∧ (x → w). На рисунке приведён частично заполненный фрагмент таблицы 
истинности функции F, содержащий неповторяющиеся строки. Определите, какому столбцу 
таблицы истинности функции F соответствует каждая из переменных x, y, z, w.

```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((not(x or y) <= (z and w)) and (x <= w)):
                    print(x, y, z, w)
```

Ответ: zxyw

## Тип 8 №27287
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w. На рисунке приведён фрагмент таблицы истинности функции F, 
содержащий все наборы аргументов, при которых функция F ложна. Определите, какому столбцу таблицы 
истинности функции F соответствует каждая из переменных w, x, y, z. Все строки в представленном фрагменте разные.

```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((((not z) or w) and ((not x) == y)) <= (x and z)) == False:
                    print(x, y, z, w)
```

Ответ: wzyx

## Тип 3 №7667
Сколько слов длины 5, начинающихся с гласной буквы, можно составить из букв Е, Г, Э? 
Каждая буква может входить в слово несколько раз. Слова не обязательно должны быть осмысленными словами русского языка.
```
a = 0
for x in 'ЕЭ':
    for y in 'ЕГЭ':
        for z in 'ЕГЭ':
            for w in 'ЕГЭ':
                for e in 'ЕГЭ':
                    a += 1
print(a)
```

Ответ: 162

## Тип 8 №8098
Вася составляет 5-⁠буквенные слова, в которых есть только буквы С, Л, О, Н, причём буква С используется в каждом слове ровно 1 раз. 
Каждая из других допустимых букв может встречаться в слове любое количество раз или не 
встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. 
Сколько существует таких слов, которые может написать Вася?
```
a = 0
for x in 'СЛОН':
    for y in 'СЛОН':
        for z in 'СЛОН':
            for w in 'СЛОН':
                for e in 'СЛОН':
                    s = x + y + z + w + e
                    if s.count('С') == 1:
                        a += 1
print(a)
```

Ответ: 405

## Тип 8 №3206
Все 5-⁠буквенные слова, составленные из букв А, К, Р, У, записаны в алфавитном порядке. Вот начало списка:
1.  ААААА
2.  ААААК
3.  ААААР
4.  ААААУ
5.  АААКА
...
```
a = 0
for x in 'АКРУ':
    for y in 'АКРУ':
        for z in 'АКРУ':
            for w in 'АКРУ':
                for e in 'АКРУ':
                    a += 1
                    if x == 'К':
                        print(a)
```

Ответ: 257
