# Задания с перебором for.
## Задание 1.
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [10000; 20001],
числа, имеющие ровно 5 различных делителей. Выведите эти делители для каждого найденного 
числа в порядке возрастания.
```
for n in range(10000, 20002):
    a = 0
    for i in range(1, n + 1):
        if n % i == 0:
            a += 1
            if a > 5:
                break
    if a == 5:
        s = []
        for i in range(1, n + 1):
            if n % i == 0:
                s.append(i)
        print(f"{n}: {s}")
```

## Задание 2.
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому
отрезку [10000; 12345], простые числа. Выведите сумму этих чисел. 
```
a = 0
for n in range(10000, 12345):
    c = True
    if n < 2:
        c = False
    else:
        for i in range(2, n):
            if n % i == 0:
                c = False
                break
    if c:
        a += n
print(a)
```

## Задание 3.
Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
Для какого наибольшего натурального числа А формула тождественно истинна 
(т.е. принимает значение 1 при любом натуральном значении переменной x)? 
Напишите программу для решения данной задачи. 
(¬ДЕЛ(x, A) ∧ ДЕЛ(x, 4)) → ¬ДЕЛ(x, 9)
```
for A in range(1, 1000):
    a = True
    for x in range(1, 1000):
        if ((x % A != 0) and (x % 4 == 0)) and (x % 9 == 0):
            a = False
            break
    if a:
        print(A)
        break
```

## Задание 4.
Для какого наименьшего числа А формула  тождественно истинна для любых целых
положительных значений x и y. Напишите программу для решения данной задачи. 
(x > 15) ∨ (x < 2y) ∨ (A > x+y)
```
for A in range(1, 100):
    a = True
    for x in range(1, 100):
        for y in range(1, 100):
            if not (x > 15) and not (x < 2*y) and not (A > x + y):
                a = False
                break
        if not a:
            break
    if a:
        print(A)
        break
```

## Задание 5.
Автомат обрабатывает натуральное число N по следующему алгоритму: 
1. Строится двоичная запись числа N. 
2. Складываются все цифры полученной двоичной записи. В конец записи (справа) дописывается 
остаток от деления полученной суммы на 2. 
3. Предыдущий пункт повторяется для записи с добавленной цифрой. 
4. Результат переводится в десятичную систему и выводится на экран. 
Пример. Дано число N = 35. Алгоритм работает следующим образом: 
1. Двоичная запись числа N: 100011. 
2. Сумма цифр двоичной записи 3, остаток от деления на 2 равен 1, новая запись 1000111. 
3. Сумма цифр полученной записи 4, остаток от деления на 2 равен 0, новая запись 10001110. 
4. На экран выводится число 142. 
Какое наибольшее число, меньшее 100, может появиться на экране в результате работы автомата?
```
a = 0
for n in range(1, 100):
    s = bin(n)[2:]
    s = s + str(s.count('1') % 2)
    s = s + str(s.count('1') % 2)
    b = int(s, 2)
    if b < 100 and b > a:
        a = b
print(a)
```

## Задания 6.
Автомат обрабатывает натуральное число N по следующему алгоритму: 
1. Строится двоичная запись числа N. 
2. Складываются все цифры полученной двоичной записи. В конец записи (справа) дописывается 
остаток от деления полученной суммы на 2. 
3. Предыдущий пункт повторяется для записи с добавленной цифрой. 
4. Результат переводится в десятичную систему и выводится на экран. 
Пример. Дано число N = 35. Алгоритм работает следующим образом: 
1. Двоичная запись числа N: 1101. 
2. Сумма цифр двоичной записи 3, остаток от деления на 2 равен 1, новая запись 1000111. 
3. Сумма цифр полученной записи 4, остаток от деления на 2 равен 0, новая запись 10001110. 
4. На экран выводится число 142. 
При каком наибольшем числе N алгоритм выведет число, меньшее 150?
```
a = 0
for n in range(1, 100):
    s = bin(n)[2:]
    s = s + str(s.count('1') % 2)
    s = s + str(s.count('1') % 2)
    b = int(s, 2)
    if b < 150:
        a = n
print(a)
```
