# Задания с перебором for.
## Задания 1.
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [10000; 20001],
числа, имеющие ровно 5 различных делителей. Выведите эти делители для каждого найденного 
числа в порядке возрастания.
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((x and (not y) or (y == z) or (not w))) == False:
                    print(x, y, z, w)
```

## Задания 2.
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому
отрезку [10000; 12345], простые числа. Выведите сумму этих чисел. 
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((x and (not y) or (y == z) or (not w))) == False:
                    print(x, y, z, w)
```

## Задания 3.
Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
Для какого наибольшего натурального числа А формула тождественно истинна 
(т.е. принимает значение 1 при любом натуральном значении переменной x)? 
Напишите программу для решения данной задачи. 
(¬ДЕЛ(x, A) ∧ ДЕЛ(x, 4)) → ¬ДЕЛ(x, 9)
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((x and (not y) or (y == z) or (not w))) == False:
                    print(x, y, z, w)
```

## Задания 4.
Для какого наименьшего числа А формула  тождественно истинна для любых целых
положительных значений x и y. Напишите программу для решения данной задачи. 
(x > 15) ∨ (x < 2y) ∨ (A > x+y)
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((x and (not y) or (y == z) or (not w))) == False:
                    print(x, y, z, w)
```

## Задания 5.
Автомат обрабатывает натуральное число N по следующему алгоритму: 
1. Строится двоичная запись числа N. 
2. Складываются все цифры полученной двоичной записи. В конец записи (справа) дописывается 
остаток от деления полученной суммы на 2. 
3. Предыдущий пункт повторяется для записи с добавленной цифрой. 
4. Результат переводится в десятичную систему и выводится на экран. 
Пример. Дано число N = 35. Алгоритм работает следующим образом: 
1. Двоичная запись числа N: 100011. 
2. Сумма цифр двоичной записи 3, остаток от деления на 2 равен 1, новая запись 1000111. 
3. Сумма цифр полученной записи 4, остаток от деления на 2 равен 0, новая запись 10001110. 
4. На экран выводится число 142. 
Какое наибольшее число, меньшее 100, может появиться на экране в результате работы автомата?
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((x and (not y) or (y == z) or (not w))) == False:
                    print(x, y, z, w)
```

## Задания 6.
Автомат обрабатывает натуральное число N по следующему алгоритму: 
1. Строится двоичная запись числа N. 
2. Складываются все цифры полученной двоичной записи. В конец записи (справа) дописывается 
остаток от деления полученной суммы на 2. 
3. Предыдущий пункт повторяется для записи с добавленной цифрой. 
4. Результат переводится в десятичную систему и выводится на экран. 
Пример. Дано число N = 35. Алгоритм работает следующим образом: 
1. Двоичная запись числа N: 1101. 
2. Сумма цифр двоичной записи 3, остаток от деления на 2 равен 1, новая запись 1000111. 
3. Сумма цифр полученной записи 4, остаток от деления на 2 равен 0, новая запись 10001110. 
4. На экран выводится число 142. 
При каком наибольшем числе N алгоритм выведет число, меньшее 150?
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((x and (not y) or (y == z) or (not w))) == False:
                    print(x, y, z, w)
```
