# Задания с использованием цикла FOR.
## Тип 2 №15618
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w. На рисунке приведён фрагмент таблицы истинности функции F, 
содержащий все наборы аргументов, при которых функция F ложна. Определите, какому столбцу таблицы 
истинности функции F соответствует каждая из переменных w, x, y, z. Все строки в представленном фрагменте разные.

```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((x and (not y) or (y == z) or (not w))) == False:
                    print(x, y, z, w)
```

Ответ: wzyx

## Тип 2 №35460
Логическая функция F задаётся выражением ¬((x ∨ y) → (z ∧ w)) ∧ (x → w). На рисунке приведён частично заполненный фрагмент таблицы 
истинности функции F, содержащий неповторяющиеся строки. Определите, какому столбцу 
таблицы истинности функции F соответствует каждая из переменных x, y, z, w.

```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((not(x or y) <= (z and w)) and (x <= w)):
                    print(x, y, z, w)
```

Ответ: zxyw

## Тип 2 №27287
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w. На рисунке приведён фрагмент таблицы истинности функции F, 
содержащий все наборы аргументов, при которых функция F ложна. Определите, какому столбцу таблицы 
истинности функции F соответствует каждая из переменных w, x, y, z. Все строки в представленном фрагменте разные.

```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((((not z) or w) and ((not x) == y)) <= (x and z)) == False:
                    print(x, y, z, w)
```

Ответ: wzyx

## Тип 3 №7667
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w. На рисунке приведён фрагмент таблицы истинности функции F, 
содержащий все наборы аргументов, при которых функция F ложна. Определите, какому столбцу таблицы 
истинности функции F соответствует каждая из переменных w, x, y, z. Все строки в представленном фрагменте разные.

```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((((not z) or w) and ((not x) == y)) <= (x and z)) == False:
                    print(x, y, z, w)
```

Ответ: wzyx

## Тип 3 №8098
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w. На рисунке приведён фрагмент таблицы истинности функции F, 
содержащий все наборы аргументов, при которых функция F ложна. Определите, какому столбцу таблицы 
истинности функции F соответствует каждая из переменных w, x, y, z. Все строки в представленном фрагменте разные.

```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((((not z) or w) and ((not x) == y)) <= (x and z)) == False:
                    print(x, y, z, w)
```

Ответ: wzyx

## Тип 3 №3206
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w. На рисунке приведён фрагмент таблицы истинности функции F, 
содержащий все наборы аргументов, при которых функция F ложна. Определите, какому столбцу таблицы 
истинности функции F соответствует каждая из переменных w, x, y, z. Все строки в представленном фрагменте разные.

```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((((not z) or w) and ((not x) == y)) <= (x and z)) == False:
                    print(x, y, z, w)
```

Ответ: wzyx
